app/Controllers/UnitKerjaController.php

SELECT *
FROM `unitkerja`
---
    public function index()
    {
        //
        $model = new UnitKerjaModel();
        $data['units'] = $model->findAll();

INSERT INTO `unitkerja` (`nama_unitkerja`, `kepala_unitkerja`) VALUES ('var', 'var')
---
    public function store()
    {
        //
        $model = new UnitKerjaModel();
        $data = [
            'nama_unitkerja'  => $this->request->getPost('nama_unitkerja'),
            'kepala_unitkerja' => $this->request->getPost('kepala_unitkerja')
        ];
        $model->insert($data);